var a = `1	ЦАО	ГБУЗ "МНПЦ МРВСМ ДЗМ" филиал № 1	г. Москва, ул. Земляной вал, д.53 стр.18	нежилое 	1931	не используется	146.9	1 этажное с мезонином
2	ЦАО	ГБУЗ "ГКОБ №1 ДЗМ"	 г. Москва, ул. Бауманская, д. 17/1, корпус 1	Корпус № 1	1938	используется	3612.2	4 этажа + (подвал и техэтаж)
3	ЦАО	ГБУЗ "Морозовская ДГКБ ДЗМ"	г.Москва, 4-й Добрынинский пер. д.1/9, стр.33	стр. 33 (лечебный)	1968	не используется	301	1
4		ГБУЗ "Морозовская ДГКБ ДЗМ"	г.Москва, 4-й Добрынинский пер. д.1/9, стр.42	стр. 42 (лечебный)	1968	не используется	140.6	1+подвал
5		ГБУЗ "Морозовская ДГКБ ДЗМ"	г.Москва, 4-й Добрынинский пер. д.1/9, стр.43	стр.43 (лечебный)	1968	не используется	870.5	1+подвал
6		ГБУЗ "Морозовская ДГКБ ДЗМ"	г.Москва, 4-й Добрынинский пер. д.1/9, стр.45	стр. 45 (лечебный)	1968	не используется	612.9	2+подвал
7	ЦАО	ГКБ № 1 им. Н.И. Пирогова	г. Москва, Ленинский пр-т, дом 10,корп. 9	Лечебный корпус	1917	не используется	366.6	2+подвал
8	ЮВАО	ГБУЗ "ГКБ № 13 ДЗМ"	г. Москва ул. Велозаводская д.1/1 стр.№6	ПАК	1963	не используется	223.8	1
9		ГБУЗ "ГКБ № 13 ДЗМ"	г. Москва ул. Велозаводская д.1/1 стр.№14	Склад	1980	 используется	197.3	1
10	ЮВАО	ГБУЗ "МНПЦ Наркологии ДЗМ"	Симферопольский бульвар д.12,стр.1	Планировался под архив	2011	не используется	243	2
11		ГБУЗ "МНПЦ Наркологии ДЗМ"	Симферопольский бульвар д.10,стр.3	Планировался под склад	2011	не используется	288	2
12	ЮВАО	ГБУЗ "ДС № 19 ДЗМ"	Тул-ая обл.,Заокский р-он,п.Приокский	Лечебный корпус	1936	не используется	471.6	2
13		ГБУЗ "ДС № 19 ДЗМ"	Тул-ая обл.,Заокский р-он,п.Приокский	Хозяйственный корпус	1953	не используется	13.2	1
14	ВАО	ГБУЗ "ПКБ № 4 им.П.Б.Ганнушкина ДЗМ" Филиал «Психиатрический стационар им. В.А. Гиляровского»	г. Москва, ул. Матросская тишина, д. 20, стр. 13	пищеблок	1938	не используется	194.1	1
15	ВАО	ГБУЗ "ПКБ № 4 им.П.Б.Ганнушкина ДЗМ" Филиал «Психиатрический стационар им. В.А. Гиляровского»	г. Москва, ул. Матросская тишина, д. 20, стр. 8	оранжерея	1962	не используется	214.7	1
16	ВАО	ГБУЗ "ИКБ № 2 ДЗМ"	г. Москва, 8-я ул. Соколиной горы, д. 15, корпус15	нежилое 	1943	не используется	1163	2
17	ВАО	ГБУЗ "ИКБ № 2 ДЗМ"	г. Москва, 8-я ул. Соколиной горы, д. 15, строение 22	нежилое 	1960	не используется	102.8	1
18	ВАО	ГБУЗ "ИКБ № 2 ДЗМ"	г. Москва, 8-я ул. Соколиной горы, д. 15, строение 23	нежилое 	1990	не используется	111	1
19	ВАО	ГБУЗ "ГКБ им. Д.Д. Плетнева ДЗМ"	 г. Москва, 11-я парковая д. 32, стр. 7	нежилое 	1958	не используется	380	1
20	ВАО	ГБУЗ "ДГКБ св.Владимира ДЗМ"	г. Москва, Рубцовско-Дворцовая, д. 1/3	Корпус № 4 (лаборатория)	1953	не используется	3495	5+подвал
21	ВАО	ГБУЗ "ГКБ им. Братьев Бахрушиных ДЗМ"	г. Москва, ул. Стромынка, д. 7	Корпус № 37	1956	не используется	27.6	1
22	ВАО	ГБУЗ "МКНЦ им. А.С. Логинова ДЗМ"	г. Москва, ш.Энтузиастов, д. 86	корпус № 1 административно-лечебный 	1957	не используется	9643.6	5+подвал
23	ВАО	ГБУЗ "МКНЦ им. А.С. Логинова ДЗМ"	г. Москва, ул.Новогиреевская д. 1	корпус № 2 (лечебный)	1956	не используется	13854.1	9+подвал
24	ВАО	ГБУЗ "МКНЦ им. А.С. Логинова ДЗМ"	г. Москва, ул.Новогиреевская д. 1, стр. 3, пом. 1	корпус № 9 ПАК	1956	не используется	210.5	1
25	ЮАО	ГБУЗ "ГКБ №4 ДЗМ"	г. Москва, ул. Павловская, д.25, стр.36	Оранжерея	1958	не используется	143.6	1 этажное
26	ЮАО	ГБУЗ "ГКБ им. В.М. Буянова ДЗМ"	г. Москва, ул. Бакинская, д.26, стр.6	Склад	1983	используется	174.1	1 этажное
27	ЮАО	ГБУЗ "ГКБ им. В.М. Буянова ДЗМ"	г. Москва, ул. Бакинская, д.26, стр.8	Склад	1983	используется	90	1 этажное
28	МО	ГБУЗ "ПКБ №5 ДЗМ"	МО, Чеховский р-н, с. Троицкое, д.5	Склад масел	1972	не используется	20.1	1
29	МО	ГБУЗ "ПКБ №5 ДЗМ"	МО, Чеховский р-н, с. Троицкое, д.5	Здание склада хранения материальных ценностей	1956	Используется частично	589	1
30	МО	ГБУЗ "ПКБ №5 ДЗМ"	МО, Чеховский р-н, с. Троицкое, д.5	Здание оборотного водоснабжения (автомойка)	2003	не используется	17.9	1
31	МО	ГБУЗ "ПКБ №5 ДЗМ"	МО, Чеховский р-н, с. Троицкое, д.5	Хлораторная	1984	не используется	93.2	2
32	СЗАО	ГБУЗ "ИКБ № 1 ДЗМ"	г. Москва, Волоколамское шоссе, д. 63, корп. 2	Лечебный корпус	1962	используется	6615.1	3 этажа + (подвал и техэтаж)
33		ГБУЗ "ИКБ № 1 ДЗМ"	г. Москва, Волоколамское шоссе, д. 63, корп. 3	Лечебный корпус	1962	используется	6555.8	3 этажа + (подвал и техэтаж)
34		ГБУЗ "ИКБ № 1 ДЗМ"	г. Москва, Волоколамское шоссе, д. 63, корп. 6	Пищеблок	1961	используется	1238.2	1 этажа + (подвал и техэтаж)
35		ГБУЗ "ИКБ № 1 ДЗМ"	г. Москва, Волоколамское шоссе, д. 63, корп. 11	Оранжерея	1962	не используется	361	1 этаж
36		ГБУЗ "ИКБ № 1 ДЗМ"	г. Москва, Волоколамское шоссе, д. 63, корп. 12	Рентгенпленки	1961	не используется	31	1 этаж`




var b = a.split('\n')
var c = b.map(
	e => e.split('\t')
)

let curAo = '';
var d = c.map(bg => {
    curAo = bg[1] ? bg[1] : curAo;
    return {
        ao: curAo,
        name: bg[2],
        address: bg[3],
        building: bg[4],
        year: bg[5],
        usage: bg[6],
        space: bg[7],
        floors: bg[8]
    }
})

let geores = [];

data.forEach(async bg => {
    geores.push(await ymaps.geocode(bg.address));
})